# Video 2: DataFrame and Series Basics

In [12]:
import pandas as pd

In [13]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@gmail.com"]
}

people["first"]

['Corey', 'Jane', 'John']

In [14]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@gmail.com

In [15]:
df["first"]  # returns a Series

0    Corey
1     Jane
2     John
Name: first, dtype: object

In [16]:
df[["first", "last"]]  # returns a DataFrame

   first     last
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [17]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [18]:
df.index = ['cs', 'janed', 'johnd']

In [20]:
df.loc[['cs', 'janed']]

       first     last                    email
cs     Corey  Schafer  CoreyMSchafer@gmail.com
janed   Jane      Doe        JaneDoe@email.com

In [21]:
df.iloc[[0, 1], [0, 1]]

       first     last
cs     Corey  Schafer
janed   Jane      Doe

In [23]:
df.iloc[0:2]

       first     last                    email
cs     Corey  Schafer  CoreyMSchafer@gmail.com
janed   Jane      Doe        JaneDoe@email.com

In [25]:
df['email']

cs       CoreyMSchafer@gmail.com
janed          JaneDoe@email.com
johnd          JohnDoe@gmail.com
Name: email, dtype: object

In [29]:
df.set_index('email', inplace=True)

In [31]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@gmail.com         John      Doe

In [33]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@gmail.com'], dtype='object', name='email')

In [34]:
df.reset_index()  # note it returns, you can also use inplace=True

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@gmail.com   John      Doe